# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
#
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

a = 2
b = 3
i = 1
while b > a:
    print(f'{i} - день: {a:.2f}')
    a = a + a / 100 * 10
    i += 1
if a > b:
    print(f'{i} - день: ' + "{:.2f}".format(a))
print(f'Ответ: на 6-й день спортсмен достиг результата — в {a:.2f} км')
